example_dataset = [
    {
        "user_query": "Εχετε κοσμηματα miyuki?",
        "retrieved_context": ["Το καταστημα μας εχει κοσμηματα και χαντρες απο διαφορα ειδη ενα εκ των οποιων και το miyuki", 
                    ". κοσμηματα με χαντρες η miyuki κοσμηματα δεν επιστρεφονται αν ανοιχτουν", 
                    "Οπως παραλαβατε ενα προιον θα πρεπει με τον ιδιο τροπο να επιστρεφται"],
        "llm_answer": "Βεβαιως! Στο καταστημα μας εχουμε πολλα κοσμηματα μαζι και miyuki χαντρες"
    },
    {
        "user_query": "Πως μπορω να επικοινωνησω μαζι σας?",
        "retrieved_context": ["Το email επικοινωνιας ειναι το marmero@gmail.com στο οποιο δεχομαστε και παραγγελειες", 
                    "... το τηλεφωνο μας σε περιπτωση που θελετε αμεση επικοιωνια μαζι μας ειναι το 2102345678", 
                    "Marmero σημαινει επικοινωνια με το περιβαλλον την φυση και τον κοσμο."],
        "llm_answer": "Μπορειτε να μας στειλετε email στο marmero@gmail.com η να μας παρετε τηλεφωνο στο 2102345678"
    }
]